app/views/invoices/_form.html.erb

            <div class="col-xs-4"><label>Invoice #</label></div>
            <div class="col-xs-8 invoice_num"><span id="invoice_number"><%= (Invoice.last.present? ? (Invoice.last.id + 1) : 1) %></span></div>
---
SELECT  "invoices".* FROM "invoices"  ORDER BY "invoices"."id" DESC LIMIT 1