app/views/users/index.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]
---
      <% end %>
            <% if user.role.present? %>