app/controllers/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
  def index
    @businesses = Business.all

INSERT INTO "businesses" ("business_name", "phone_number", "email", "street_address", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @business = Business.new(business_params)

    respond_to do |format|
      if @business.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_business
      @business = Business.find(params[:id])