app/controllers/crews_controller.rb

SELECT "crews".* FROM "crews"
---
  def index
    @crews = Crew.all

INSERT INTO "crews" ("crew_name", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["crew_name", "dfda"], ["employee_id", 1], ["created_at", "2016-04-08 17:13:07.241503"], ["updated_at", "2016-04-08 17:13:07.241503"]]
---
  def create
    @crew = Crew.new(crew_params)

    respond_to do |format|
      if @crew.save

SELECT  "crews".* FROM "crews" WHERE "crews"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_crew
      @crew = Crew.find(params[:id])