app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @search = Customer.search(params[:q])

INSERT INTO "customers" ("customer_name", "phone_number", "email", "street_address", "city", "state", "zip", "business_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save