app/controllers/employees_controller.rb

INSERT INTO "employees" ("employee_name", "employee_email", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_name", "Juan"], ["employee_email", "j@gmail.com"], ["role_id", 1], ["created_at", "2016-04-08 17:12:47.745803"], ["updated_at", "2016-04-08 17:12:47.745803"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save