app/controllers/invoices_controller.rb

  def index
    @search = Invoice.search(params[:q])
---
SELECT "invoices".* FROM "invoices"

  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save
---
INSERT INTO "invoices" ("terms", "created_at", "updated_at") VALUES (?, ?, ?)  [["terms", ""], ["created_at", "2016-04-05 22:25:38.605784"], ["updated_at", "2016-04-05 22:25:38.605784"]]

  def destroy
    @invoice.destroy
---
DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 2]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 2]]