app/controllers/roles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role_id" = ?  [["role_id", 3]]
---
  def show

    if @role.users.length == 0

INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Customer"], ["description", "Can view invoices"], ["created_at", "2016-02-15 22:58:25.828917"], ["updated_at", "2016-02-15 22:58:25.828917"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_role
      @role = Role.find(params[:id])