app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT "services".* FROM "services"

  def create
    #@service.user_id = current_user.id

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_service
      @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", 1]]